Repository: blindelectron/configs
Catalog: nvda/addons/NVDAExtensionGlobalPlugin/locale/*/LC_MESSAGES/nvda.po
Languages: ru

source: Redefined in %s
ru: Переопределено в %s

source: Enter new label:
ru: Введите новую метку

source: Key label redifinition
ru: переопределение метки клавиши

source: New name is removed
ru: Новое имя удалено

source: No modification
ru: нет изменений

source: All replacement labels have been removed
ru: Все заменяющие метки были удалены

source: End duration in %s minutes
ru: длительность в %s минут

source: End duration in one minute
ru: оставшаяся длительность одна минута

source: End of minutetimer
ru: Конец таймера

source: Launch of the Minute timer
ru: Запуск таймера

source: Enter the minute timer &duration (in minutes):
ru: Введите Длительность таймера (в минутах):

source: Enter the &announce to be spoken at the end of duration:
ru: Введите что произнести по окончанию времени:

source: Delay to be alerted before ending (in minutes):
ru: Задержка уведомления перед окончанием (в минутах):

source: Ring's &Options
ru: опции сигналов

source: Duration is not valid
ru: неправильная длительность

source: The Delay to be notified before duration ending must be smaller than duration
ru: Задержка для уведомления перед окончанием должна быть меньше продолжительности.

source: Minute timer started for %s minutes
ru: Таймер запущен на %s минут

source: Ring options
ru: Настройки сигналов

source: &Number of rings:
ru: Количество звонков:

source: &Delay between rings (in milliseconds):
ru: Задержка между сигналами (в миллисекундах):

source: Current minute timer
ru: текущий таймер

source: Remaining duration:
ru: Оставшаяся время:

source: &Stop
ru: &Стоп

source: Minute timer is stopped
ru: Таймер остановлен

source: %s seconds
ru: %s секунд

source: {minutes} minutes {seconds}
ru: {minutes} минут и {seconds} секунд

source: NVDA logs management
ru: Управление журналами NVDA

source: Open &current log
ru: открыть текущий журнал

source: Open &previous log
ru: открыть предыдущий журнал

source: Copy current log file &path to clipboard
ru: копировать путь к файлу текущего журнала в буфер обмена

source: Copy &old log file path to clipboard
ru: Скопировать &старый путь к файлу журнала в буфер обмена

source: Open Error
ru: открыть ошибки

source: old log file path copied to clipboard
ru: копировать путь к старому файлу журнала в буфер обмена

source: old log file path cannot be copied to clipboard
ru: путь к старому файлу журнала не может быть скопирован в буфер обмена

source: %s dialog is allready open
ru: %s диалог уже открыт

source: Font:
ru: Шрифт:

source: Family: %s
ru: семейство шрифтов: %s

source: Name: %s
ru: Название: %s

source: Size: %s
ru: Размер: %s

source: Text's alignment: %s
ru: выравнивание: %s

source: Attributes: %s
ru: Атрибуты: %s

source: Vertical alignment: %s
ru: Вертикальное выравнивание: %s

source: Position: %s
ru: Позиция: %s

source: Paragraph's indentation: %s
ru: отступ абзацев: %s

source: style: %s
ru: Стиль: %s

source: Line spacing: %s
ru: Межстрочный интервал: %s

source: Indentation: %s
ru: отступ: %s

source: Formatting's Informations
ru: Информация о форматировании

source: Voice profile switching
ru: Переключатель голосовых профилей

source: Display the running application windows's list with opportunity to put one of them on the foreground or destroy it
ru: Отображение списка окон запущенных приложений с возможностью добавления одного из них на передний план или закрыть его

source: Shows the list of buttons on the System Tray
ru: Показывает список кнопок на панели задач

source: Display the dialog to shutdown, reboot or hibernate the computer
ru: Отображение диалогового окна для выключения, перезагрузки или перехода компьютера в спящий режим

source: Shutdown the computer
ru: Выключить компьютер

source: Reboot the computer
ru: Перезагрузка компьютера

source: Hibernate the computer
ru: Переход в ждущий режим

source: Allow you to copy or type complex symbol
ru: Позволяют копировать или вводить сложный символ

source: Display the list of last used complex symbols
ru: Показать список последних использованных сложных символов

source: Display the list's visible items making up current foreground object
ru: Отображение видимых элементов списка, составляющих текущий объект переднего плана

source: If pressed twice: display the list's visible items making up it
ru: При двойном нажатии: отображение видимых элементов списка, составляющих его

source: {systrayIconsDoc}. Twice, {activeWindowsDoc}
ru: {systrayIconsDoc}. дважды, {activeWindowsDoc}

source: Report the application 's name and version
ru: Сообщить название и версию приложения

source: Speaks the filename of the active application along with the name of the currently loaded appModule python file. Pressing this key twice,speak the name and state of the current configuration profile
ru: Произносит имя файла активного приложения вместе с именем загруженный в данный момент файл python appModule. Нажав эту кнопку дважды, прослушайте имя и состояние текущего профиля конфигурации

source: Report the name and version number of add-on activated for focused application
ru: Сообщите название и номер версии дополнения, активированной для целевого приложения

source: Display informations about the focused application
ru: Отображение информации о выбранном приложении

source: Display dialog to start the minute timer. If minute timer already started, display dialog to report duration
ru: Отображение диалогового окна для запуска таймера. Если таймер уже запущен,отобразить диалоговое окно оставшегося времени

source: Display add-on user's guide
ru: Показать руководство пользователя дополнения

source: Display the list of commands of the commands interpreter
ru: Показать список команд интерпретатора команд

source: Open a dialog to manage NVDA logs
ru: Откройте диалоговое окно для управления журналами NVDA.

source: Open current NVDA log file. Pressing this key twice, open the old NVDA log file. Pressing third, copy current log path to the clipboard
ru: Откройте текущий файл журнала NVDA. Дважды нажав эту кнопку, откройте старый файл журнала NVDA. Нажав трижды, скопируйте текущий путь журнала в буфер обмена

source: report the name of current selected folder in the open or Save dialog box. Twice: report full path
ru: сообщить имя текущей выбранной папки в диалоговом окне открытия или сохранения. Дважды: сообщить полный путь

source: report the name of current selected folder in the open or Save dialog box
ru: сообщить имя текущей выбранной папки в диалоговом окне открытия или сохранения

source: report the full path of current selected folder in the open or Save dialog box
ru: сообщить полный путь к текущей выбранной папке в диалоговом окне открытия или сохранения

source: Explore my user configuration's folder
ru: Просмотр папки с пользовательской конфигурацией

source: Explore NVDA program's folder
ru: Просмотр папки NVDA

source: Display speech history records
ru: Отображение записей истории речи

source: Report previous record of the speech history and copy it to clipboard
ru: Сообщить о предыдущей записи истории речи и скопировать ее в буфер обмена

source: Report current record of the speech history and copy it to clipboard. Twice: display speech history
ru: Сообщите о текущей записи истории речи и скопируйте ее в буфер обмена. Дважды: отображать историю речи

source: Report next record of the speech history and copy it to clipboard
ru: Сообщить о следующей записи истории речи и скопировать ее в буфер обмена

source: Restart NVDA. Twice: restart with log level set to debug
ru: Перезапустите NVDA. Дважды: перезапустите с уровнем журнала, установленным для отладки

source: Toggle voice profile switch mode
ru: Переключатель режимов голосовых профилей

source: Display dialog to manage voice profile selectors
ru: Отображение диалогового окна для управления селекторами голосового профиля

source: Go backward to the first selector associated to a voice profile and set this voice profile as current voice profile
ru: Вернитесь к первому селектору, связанному с голосовым профилем, и установите этот голосовой профиль в качестве текущего голосового профиля.

source: Go to forward to the first selector associated to a voice profile and set this voice profile as current voice profile
ru: Перейдите к первому селектору, связанному с голосовым профилем, и установите этот голосовой профиль в качестве текущего голосового профиля.

source: Display keyboard keys renaming dialog
ru: Отображение диалогового окна переименования клавиш

source: Display command key selective announcement dialog
ru: Отобразить диалоговое окно выборочного объявления командных клавиш

source: Report the current time. Twice: report the current date. Third: copy date and time to the clipboard
ru: Сообщите текущее время. Дважды: укажите текущую дату. трижды: скопируйте дату и время в буфер обмена

source: Copy date and time to the clipboard
ru: Копировать дату и время в буфер обмена

source: Display, in dialog box, formatting informations for the current review cursor position within a document
ru: Отображение в диалоговом окне информации о форматировании для текущей позиции курсора обзора в документе

source: Launch commands's interpreter of add-on
ru: Запуск интерпретатора команд

source: Set selector 1 as current selector and set, if possible, its associated voice profile as current voice profile
ru: Установите селектор 1 как текущий селектор и установите, если возможно, связанный с ним голосовой профиль в качестве текущего голосового профиля

source: Set selector 2 as current selector and set, if possible, its associated voice profile as current voice profile
ru: Установите селектор 2 как текущий селектор и установите, если возможно, связанный с ним голосовой профиль в качестве текущего голосового профиля

source: Set selector 3 as current selector and set, if possible, its associated voice profile as current voice profile
ru: Установите селектор 3 как текущий селектор и установите, если возможно, связанный с ним голосовой профиль в качестве текущего голосового профиля

source: Set selector 4 as current selector and set, if possible, its associated voice profile as current voice profile
ru: Установите селектор 4 как текущий селектор и установите, если возможно, связанный с ним голосовой профиль в качестве текущего голосового профиля

source: Set selector 5 as current selector and set, if possible, its associated voice profile as current voice profile
ru: Установите селектор 5 как текущий селектор и установите, если возможно, связанный с ним голосовой профиль в качестве текущего голосового профиля

source: Set selector 6 as current selector and set, if possible, its associated voice profile as current voice profile
ru: Установите селектор 6 как текущий селектор и установите, если возможно, связанный с ним голосовой профиль в качестве текущего голосового профиля

source: Set selector 7 as current selector and set, if possible, its associated voice profile as current voice profile
ru: Установите селектор 7 как текущий селектор и установите, если возможно, связанный с ним голосовой профиль в качестве текущего голосового профиля

source: Set selector 8 as current selector and set, if possible, its associated voice profile as current voice profile
ru: Установите селектор 8 как текущий селектор и установите, если возможно, связанный с ним голосовой профиль в качестве текущего голосового профиля

source: Displays the dialog to manage the input gestures configured by user
ru: Отображает диалоговое окно для управления жестами, настроенными пользователем.

source: Display tools for add-on development dialog
ru: Отображение диалога инструментов для разработки дополнения

source: Click the left mouse button at navigator object position. Twice: click twice this button at this position
ru: Щелкните левой кнопкой мыши в позиции объекта навигатора. Дважды: двойной клик на эту кнопку в этом месте.

source: Click the right mouse button at navigator object position. Twice: click twice this button at this position
ru: Щелкните правой кнопкой мыши в позиции объекта навигатора. Дважды: двойное нажатие этой кнопки в этом месте.

source: Display add-on settings dialog
ru: показ диалога настроек дополнения

source: Display settings dialog for current configuration profile
ru: Отображение диалогового окна настроек для текущего профиля конфигурации

source: Enable or disable the standard use of numeric keypad
ru: Включение или отключение стандартного использования цифровой клавиатуры

source: Close all opened windows
ru: Закройте все открытые окна

source: Display running add-ons list
ru: Показать список запущенных дополнений

source: Report current speech settings. Twice: display them
ru: Сообщите о текущих настройках речи. Дважды: показ их

source: Report current speech settings
ru: Сообщить о текущих настройках речи

source: Display current speech settings
ru: Показать текущие настройки речи

source: activate or desactivate text analyzer
ru: активировать или деактивировать анализатор текста

source: Analyze the word under system cursor
ru: Проанализировать слово под системным курсором

source: Analyze the line under system cursor
ru: Анализировать строку под системным курсором

source: Analyze the sentence under system cursor
ru: Проанализировать предложение под системным курсором

source: Analyze the paragraph under system cursor
ru: Проанализировать абзац под системным курсором

source: Display the dialog to manage user configurations
ru: Отображение диалогового окна для управления пользовательскими конфигурациями

source: Toggle reporting of current caret position in edit box
ru: Переключить отчет о текущей позиции курсора в поле редактирования

source: Add, to clipboard, the selected text
ru: Добавить в буфер обмена выделенный текст

source: Display the temporary audio device manager
ru: Отображение временного диспетчера аудиоустройств

source: Leave up the temporary audio device
ru: отключить временное аудиоустройство

source: Set, as temporary audio device, the next device in the list of checked devices of the temporary audio device manager
ru: Установить в качестве временного аудиоустройства следующее устройство в списке отмеченныхустройства временного диспетчера аудиоустройств

source: Set, as temporary audio output device , the next device in the list of devices selected in the temporary audio output device manager. Twice: leave up the temporary audio output device
ru: Установить в качестве временного устройства вывода звука следующее устройство в спискеустройства, выбранные во временном диспетчере устройств вывода звука. Дважды: оставитьвключить временное устройство вывода звука

source: Set on main and NVDA volume
ru: установка основной и NVDA громкости

source: Toggle current focused application volume mute
ru: Переключить отключение звука текущего приложения

source: Increase volume of current focused application
ru: увеличение громкости текущего приложения

source: Decrease volume of current focused application
ru: Уменьшение громкости текущего приложения

source: Maximize volume of current focused application
ru: Максимальная громкость текущего приложения

source: Minimize volume of current focused application
ru: Минимальная громкость текущего приложения

source: Increase volume of speakers
ru: Увеличьте громкость динамиков

source: Decrease volume of speakers
ru: Уменьшите громкость динамиков

source: Maximize volume of speakers
ru: Максимальная громкость динамиков

source: Minimize volume of speakers
ru: минимальная громкость динамиков

source: Set the volume of current focused application to previous level
ru: Установите громкость текущего приложения на предыдущий уровень

source: Set the main volume to previous level
ru: Установка главной громкости на предыдущий уровень

source: The configuration file of "%s" add-on contains errors. The add-on configuration has been reset to default configuration
ru: Файл конфигурации дополнения "%s" содержит ошибки. Конфигурация дополнения была сброшена до конфигурации по умолчанию

source: The old configuration file of "%s" add-on contains errors. It's not possible to keep previous configuration
ru: Старый файл конфигурации дополнения "%s " содержит ошибки. Это не такможно сохранить предыдущую конфигурацию

source: The add-on configuration will be reset to factory values and NVDA will be restarted. Would you like to continue?
ru: Конфигурация дополнения будет сброшена до заводских значений, и NVDA будет перезапущена. Желаете ли вы продолжить?

source: Configuration reset
ru: сброс конфигурации

source: It's time
ru: время прошло

source: Some changes have been made. You must save the configuration and restart NVDA for these changes to take effect. Would you like to do it now?
ru: Внесены некоторые изменения. Вы должны сохранить конфигурацию и перезапустить NVDA, чтобы эти изменения вступили в силу. Хотели бы вы сделать это сейчас?

source: Don't forget to save the configuration for the changes to take effect !
ru: Не забудьте сохранить конфигурацию, чтобы изменения вступили в силу!

source: Features's installation
ru: установка функций

source: Do not install
ru: Не устанавливать

source: Install
ru: Установить

source: Install without gesture
ru: Установить без жестов

source: Display &systray icons and running application windows list:
ru: Отображение значков в панели задач и список окон запущенных приложений:

source: &Complex symbols edition help:
ru: помощь по редактированию сложных символов:

source: &Focused application's informations:
ru: информация о приложении

source: &Extended Virtual Buffer:
ru: Расширенный виртуальный буфер:

source: C&lipboard command announcement:
ru: Объявление команды буфера обмена:

source: Anno&uncement of the preselected folder in "Open", "Save", "Save as" dialog boxes:
ru: Аннулировать и сохранить предварительно выбранную папку в "Открыть", "Сохранить", "Сохранить как" диалоговые окна:

source: &NVDA's log Files:
ru: файлы журнала NVDA:

source: Speech &history:
ru: история речи:

source: &Keyboard keys renaming:
ru: Переименование клавиш:

source: C&ommand keys selective announcement:
ru: Выборочное объявление командных клавиш:

source: Minute &timer:
ru: Таймер:

source: NVDA's &restart:
ru: Перезагрузка NVDA:

source: Display visible items making up the foreground &object:
ru: Отображение видимых элементов, составляющих передний план и объект:

source: &Voice profile switching:
ru: Переключение голосового профиля:

source: Ke&ys's remanence:
ru: Оставшиеся клавиши:

source: Volu&me's control:
ru: Управление громкостью:

source: &Development's tools:
ru: &Инструменты разработчика:

source: &Date and time - supplements:
ru: &Дата и время - дополнения:

source: Text anal&ysis:
ru: &Текстовый анализ:

source: Temporar&y audio device:
ru: Временное &аудиоустройство:

source: NVDA enhancements
ru: Улучшения NVDA

source: Editing
ru: редактирование

source: &Report next word on deletion
ru: Сообщить следующее слово при удалении

source: maximum number of last &used symbols recorded:
ru: максимальное количество записанных последних и использованных символов:

source: Speech history
ru: история речи

source: &Number the records
ru: номера записи

source: &Display records in ascending order
ru: Отображать записи в порядке возрастания

source: Browser
ru: обзор

source: &Browse in loop
ru: навигация в цикле

source: Computer
ru: Компьютер

source: &No object description in Windows ribbons
ru: Нет описания объекта в ленте Windows

source: Automatically &maximize windows
ru: автоматически разворачивать окно

source: Report &windows clock's time with seconds
ru: Сообщать время с секундами

source: Main and NVDA volume
ru: Главная и NVDA громкости

source: Set on &volume at the loading of the add-on
ru: Включите & громкость при загрузке дополнения

source: Main volume
ru: Главная громкость

source: &Threshold of recovery of the volume:
ru: Порог восстановления громкости:

source: Recovery &level:
ru: Уровень восстановление:

source: NVDA volume
ru: громкость nvda

source: T&hreshold of recovery of the volume:
ru: Порог восстановления громкости:

source: &Recovery level:
ru: &Уровень восстановления:

source: Volume change
ru: изменение громкости

source: Ste&ps's size:
ru: Размер шага:

source: R&eport volume changes
ru: Отчет об изменении громкости

source: &Announce application volume level in percent
ru: Объявить уровень громкости приложения в процентах

source: Temporary audio device
ru: Временное аудио устройство

source: Ask for confirmation
ru: Запросить подтверждение

source: ma&ximum waiting time for confirmation (in seconds):
ru: максимальное время ожидания подтверждения (в секундах):

source: advanced
ru: Дополнительно

source: For No NVDA's version
ru: нет для версии NVDA

source: For Only the NVDA's snapshot versions
ru: Только для версий моментальных снимков NVDA

source: Only until the next NVDA restart
ru: Только до следующего перезапуска NVDA

source: For all NVDA's versions
ru: Для всех версий NVDA

source: &Play sound on logged errors:
ru: Воспроизведение звука при зарегистрированных ошибках:

source: &Title dialog with add-on name
ru: Заголовок диалогового окна с названием дополнения

source: &Delay between repeat of same gesture:
ru: Задержка между повторением нажатия одних и тех же жестов:

source: &Do not take account of the option called "Report object descriptions" during the display of the dialog box same as confirmation
ru: Не принимайте во внимание параметр "Отчет об описании объекта " во время отображения диалогового окна, как и при подтверждении.

source: Keyboard
ru: Клавиатура

source: Keys's remanence
ru: оставшиеся клавиши

source: &Only NVDA key in remanence
ru: Оставить только клавиши NVDA

source: Activate &remanence at NVDA's start
ru: Активация и остаточное действие при старте NVDA

source: &Remanence's delay (in milliseconds):
ru: остаточная задержка (в миллисекундах):

source: Play &sound at the start of remanence
ru: воспроизвести звук в начале остаточного

source: Play sound at the &end of remanence
ru: Воспроизвести звук в конце остаточного эффекта

source: Special remanence for &Gmail.com
ru: Особое внимание к Gmail.com

source: Numeric keypad
ru: цифровая клавиатура

source: &Allow the standard use of the numeric keypad
ru: Разрешить стандартное использование цифровой клавиатуры

source: &Enable the standard use of the numeric keypad at NVDA's start
ru: Включите стандартное использование цифровой клавиатуры при запуске NVDA

source: &Enable / disable numeric keypad's standard use with num lock key
ru: Включение / отключение стандартного использования цифровой клавиатуры с помощью клавиши Num Lock

source: Update
ru: обновление

source: Automatically check for &updates
ru: автоматическая проверка обновлений

source: Update also release versions to &development versions
ru: обновить релиз до последней версии, которая в разработке

source: &Check for update
ru: Проверка обновлений

source: View &history
ru: просмотр истории

source: Settings
ru: Настройки

source: Cursor's moving
ru: перемещение курсора

source: &Punctuation/symbol level on word movement:
ru: Уровень пунктуации при перемещении по словам:

source: Current configuration profile's level
ru: уровень текущего профиля конфигурации

source: Clipboard
ru: Буфер обмена

source: Text used as a &separator between contents added to the clipboard.
ru: Текст, используемый в качестве разделителя между содержимым, добавленным в буфер обмена.

source: &Add text before clipboard datas
ru: Добавить текст перед данными буфера обмена

source: Ask &confirmation before adding
ru: Запросить подтверждение перед добавлением

source: Text analysis
ru: Анализ текста

source: &Activate text analyzer
ru: &Активировать анализ текста

source: Activate text analyzer at add-on's &start
ru: Активировать анализатор текста при запуске дополнения

source: Symbols match
ru: Символы совпадают
