Repository: blindelectron/configs
Catalog: nvda/addons/NVDAExtensionGlobalPlugin/locale/*/LC_MESSAGES/nvda.po
Languages: ru

source: NVDA global commands extension
ru: Плагин глобальных команд NVDA

source: This add-on has been developed with the participation of Daniel Poiraud. It adds to NVDA: 1- The features Some features can be enabled or disabled individually. * Display of the list of icons in the notification area, * Display of the windows list of running applications, * Help in the composition of a symbol that is complex such as, for example, an a e related, a symbol power of 2 and possibility to add its own categories and symbols, * Extension of the functionality of the virtual buffer for browsers Mozilla Firefox, Microsoft Internet Explorer, Microsoft Edge, and Google Chrome: * new commands for navigation mode (paragraph, division, anchor, main area, * new types of elements for the dialog box opened by "NVDA+F7" (radio button, paragraph, frame, check box, ...) with the announcement of the number of items found, * commands for the tables: announce the cells of a row /column, go to first/last cell in the row/current column, move the column/row preceding or following with announcement possible of the cells in that row/column, * announcement of the URL of the document, * navigate in loop, * Announcement of the function associated with editing commands style Copy, Paste, etc., * Announcement of the name of the folder pre-selected in the dialog boxes like "Open", "Save", "Save as", ..., * display of information on the focused application: * the name and version number of the application, * the current profile configuration, * the add-on loaded for the application, * NVDA logs tools: * Opening the previous or current log, * copy of the path of these in the clipboard. * history of voice speech, * renaming keyboard keys, * selective announcement of command keyboard keys, * simple countdown timer, * display of visible elements making up the object in the foreground, * fast switching of voice profile, * remanence of the modifier keys, * shutdown, reboot or hibernate the computer, * control the main or NVDA volume: * mute or unmute volume for the focused application, * establishment of the main Windows or NVDA volume at the start of add-on, * modification of main volume or audio stream's volume of focused application. * Tools for development of add-on * supplements regarding the date and time: copy date and time to clipboard, report time with seconds * user configurations management and NVDA restarting with precise configuration, * text analyser, * announcement of the cursor position in the edit boxes, * temporary use of an audio output device without impacting the NVDA configuration. 2- The options * remove the announcement from the description of the objects in the Windows ribbons, * proclaim the word focused when deleting a word (for NVDA versions lower than 2020.3), * automatically maximize the foreground window, * announce punctuations and symbols when moving by word in a document. 3- The advanced options * report, with a sound, the registration of an error in the NVDA log also for the final versions and release candidate of NVDA, * Caption dialog title with the name of the add-on, * Do not take account of the option called Report object descriptions during the display of the dialog box style confirmation, * use numeric keypad's keys conventionally. 4- Various other elements * presentation formatting of the text in a dialog box, * sub-menus to explore the program folders or configuration, * script to quickly restart NVDA, * script to emulate the "Applications" key, * script to close all open windows, * possibility of executing scripts in the "Input gestures" dialog (for versions of NVDA greater than 2020.3).
ru: Это дополнение было разработано при участии Даниэля Пуро. Это дополнение добавляет к NVDA: 1- функции Некоторые функции можно включать или отключать по отдельности. * Отображение списка значков в области уведомлений, * Отображение списка окон запущенных приложений, * Помощь в составлении сложного символа, и возможность добавлять свои категории и символы, * Расширение функциональности виртуального буфера для браузеров Mozilla Firefox, Microsoft Internet Explorer, Microsoft Edge, и Google Chrome: * новые команды для режима навигации (абзац, раздел, анкер, главная область, * новые типы элементов для диалогового окна, открываемого "NVDA+F7" (радио кнопка, параграф, фрейм, флажок, ...) с объявлением количество найденных элементов, * команды для таблиц: объявить ячейки строки/столбца, перейти к первой/последней ячейке в строке/текущий столбец, переместить столбец / строку до или после объявления возможно из ячеек в этой строке / столбце, * объявление URL-адреса документа, * зацикленная навигация, * Объявление функции, связанных с редактированием Копирование, вставка, и другое., * Объявление названия папки, выбранной в диалоговых окнах таких как "Открыть", "Сохранить", "Сохранить как", ..., * отображение информации о приложении в фокусе: * название и номер версии приложения, * текущий профиль конфигурации, * дополнение, загруженное для этого приложения, * инструменты журналов NVDA: * Открытие предыдущего или текущего журнала, * копирование пути к ним в буфер обмена. * история произнесенных речей, * переименование клавиш, * выборочное объявление команд, * простой таймер обратного отсчета времени, * отображение видимых элементов, составляющих объект на переднем плане, * быстрое переключение голосовых профилей, * остаточность клавиш-модификаторов, * выключение, перезагрузка или переход в ждущий режим компьютера, * Управление главной или NVDA громкостью: * отключить или включить звук для выбранного приложения, * установка основной Windows или NVDA громкости при запуске дополнения, * изменение главной громкости для аудиопотока аудио-приложения. * Инструменты для разработки дополнений * Улучшения связанные с датой и временем: возможность копировать дату и время в буфер обмена, объявление времени вместе с секундами * управление пользовательскими конфигурациями и перезапуск NVDA с установленной конфигурацией, * текстовый анализатор, * объявление положения курсора в полях редактирования, * временное использование устройства вывода звука без изменения конфигурации NVDA. 2- опции * убрать объявление из описания объектов в ленте Windows, * объявлять слово в фокусе при удалении слова (для версий NVDA ниже чем 2020.3), * автоматически развернуть окно переднего плана, * объявлять знаки препинания и символы при перемещении по слову в документе. 3- расширенные опции * отчет, со звуком, также регистрация ошибки в журнале NVDA для финальных версий и релиз-кандидата NVDA, * Заголовок диалога с заголовком с названием дополнения, * Не учитывать опцию Report object descriptions во время отображение подтверждения стиля диалогового окна, * использовать клавиши цифровой клавиатуры в зависимости от условий. 4- Различные другие элементы * форматирование представления текста в диалоговом окне, * подменю для просмотра программных папок или конфигурации, * скрипт для быстрого перезапуска NVDA, * скрипт для эмуляции клавиши "Applications", * скрипт для закрытия всех открытых окон, * возможность выполнения скриптов в диалоге "жесты ввода" (для версии NVDA больше чем 2020.3).

source: Do you want to keep previous add-on configuration settings?
ru: Вы хотите сохранить предыдущие настройки конфигурации дополнения?

source: %s - installation
ru: %s - установка

source: Attention, you must uninstall "%s" add-on because it is now included in this add-on
ru: Внимание, необходимо удалить "%s" дополнение, потому что теперь оно включено в это дополнение

source: (command: %s)
ru: (команда: %s)

source: %s add-on configuration menu
ru: %s меню конфигурации дополнения

source: Global settings...
ru: Глобальные настройки...

source: Current configuration profile settings...
ru: Настройки текущего профиля конфигурации

source: Keyboard Keys renaming...
ru: Переименование клавиш ...

source: Command keys selective announcement...
ru: Выборочное объявление командных клавиш...

source: Reset configuration to default values
ru: Сброс конфигурации к значениям по умолчанию

source: Explore &NVDA
ru: Исследование &NVDA

source: Menu to explore the NVDA program folder or the user configuration folder
ru: Меню для исследования папки программы NVDA или папки конфигурации пользователя

source: My &configuration's folder
ru: Моя папка &конфигураций

source: NVDA &Program folder
ru: &папка NVDA

source: Manage user configurations
ru: Управление конфигурацией пользователя

source: Please wait
ru: подождите пожалуйста

source: {0} copied to clipboard
ru: {0} скопировано в буфер обмена

source: Configuration's profile {profileName} {state}
ru: Профиль конфигурации {profileName} {state}

source: {0} version {1}
ru: {0} версия {1}

source: Product name and version has been copied to clipboard
ru: Название и версия скопированы в буфер обмена

source: add-on: {name}, version: {version}
ru: Дополнение: {name}, версия: {version}

source: No add-on
ru: Без дополнения

source: Configuration profile: {profileName} {state}
ru: Профиль конфигурации: {profileName} {state}

source: Application: {appName} {appVersion}
ru: Приложение: {appName} {appVersion}

source: {summary}, version: {version}
ru: {summary}, версия: {version}

source: Active add-on: %s
ru: Активное дополнение: %s

source: add-on's path: %s
ru: Путь дополнения: %s

source: Warning: it seems that others add-ons are installed and activated for this application
ru: Предупреждение: похоже, что для этого приложения установлено и активировано другое дополнения

source: Loaded python module: %s
ru: Загрузка python модуля: %s

source: Application context's informations
ru: Информация о контексте приложения

source: Current log file path copied to clipboard
ru: Текущий путь к файлу журнала скопирован в буфер обмена

source: Current log file path cannot be copied to clipboard
ru: Текущий путь к файлу журнала не может быть скопирован в буфер обмена

source: Previous log file cannot be opened
ru: Предыдущий файл журнала не открывается

source: Current log file cannot be opened
ru: Текущий файл журнала не может быть открыт

source: File open Error
ru: Ошибка открытия файла

source: Are you sure you want to shutdown immediately the computer ?
ru: Вы уверены, что хотите выключить компьютер?

source: Confirmation
ru: Подтверждение

source: Are you sure you want to reboot immediately the computer ?
ru: Вы уверены, что хотите перезагрузить компьютер?

source: Are you sure you want to hibernate immediately the computer ?
ru: Вы уверены, что хотите перевести компьютер в спящий режим?

source: Current speech settings
ru: Текущие настройки речи

source: Voice profile switch mode on
ru: Включен режим переключения голосового профиля

source: Voice profile switch mode off
ru: Выключен режим переключения голосового профиля

source: Selector %s is free
ru: селектор %s свободный

source: There was no change of input gesture made by the user
ru: Пользователь не изменил жест

source: Double left click
ru: двойной левый клик

source: Object has no location
ru: Объект не имеет местоположения

source: Double right click
ru: двойной правый клик

source: This functionnality is only available if "command keys selective announcement" functionnality or "keys's remanence" functionnality is installed
ru: Эта функция доступна только в том случае, если установлена функция "Выборочное объявление командных клавиш" или установлена "Выборочное объявление командных клавиш".

source: The standard use of the numeric keypad is not allowed
ru: Стандартное использование цифровой клавиатуры не допускается.

source: Are you sure you want to close all windows?
ru: Вы уверены, что хотите закрыть все окна?

source: global
ru: Глобальный

source: application
ru: Приложение

source: speech synthesizer driver
ru: Драйвер синтезатора речи

source: braille display driver
ru: драйвер дисплея брайля

source: mixed
ru: смешанный

source: %s add-on type:
ru: %s тип дополнения:

source: any
ru: любой

source: Running add-ons
ru: Запуск дополнений

source: Text analysis not available
ru: Анализ текста недоступен

source: Nothing to report
ru: Отчет пустой

source: report current caret position on
ru: сообщить текущую позицию курсора включено

source: report current caret position off
ru: сообщить текущую позицию курсора выключено

source: cycle is not possible on audio output device
ru: цикл невозможен на устройстве вывода звука

source: Shell's scripts
ru: скрипты оболочки командной строки

source: Description: command
ru: Описание: команда

source: &Execute the script
ru: &Выполнить скрипт

source: Start menu|Charm Bar
ru: Меню Пуск

source: List of windows
ru: Список окон

source: Minimized
ru: Свернуть

source: Maximized
ru: Развернуть

source: Current &applications
ru: &Текущее приложение

source: &Switch to
ru: Переключить на

source: &Destroy
ru: Завершить

source: Destro&y all
ru: Завершить все

source: Impossible to destroy desktop window
ru: Невозможно завершить окно рабочего стола

source: Impossible to destroy the window
ru: Невозможно закрыть окно

source: Warning
ru: Предупреждение

source: moves to the next paragraph
ru: переходит к следующему параграфу

source: no next paragraph
ru: нет следующего параграфа

source: moves to the previous paragraph
ru: Переход к предыдущему параграфу

source: no previous paragraph
ru: Нет предыдущего параграфа

source: moves to the next division
ru: переход к следующему разделителю

source: no next division
ru: Нет следующего разделителя

source: moves to the previous division
ru: переход к предыдущему разделителю

source: no previous division
ru: Нет предыдущего разделителя

source: moves to the next main landmark
ru: переходит к следующему ориентиру

source: no next main landmark
ru: Нет следующего ориентира

source: moves to the previous main landmark
ru: Переход к предыдущему ориентиру

source: no previous main landmark
ru: нет предыдущего ориентира

source: moves to the next clickable element
ru: переход к следующему кликабельному объекту

source: no next clickable element
ru: нет следующих кликабельных объектов

source: moves to the previous clickable element
ru: переход к предыдущему кликабельному объекту

source: no previous clickable element
ru: нет предыдущих кликабельных объектов

source: Copied to clipboard
ru: копирование в буфер обмена

source: Cannot copy to clipboard
ru: скопировать в буфер обмена нельзя

source: Report document 's address (URL). Twice: copy it to clipboard
ru: Адрес отчета (URL). Дважды: скопируйте в буфер обмена

source: Return to bottom of page
ru: Переход в конец страницы

source: Return to top of page
ru: Переход наверх страницы

source: No label
ru: метки нет

source: Form field
ru: Поле формы

source: Report current table row's cells
ru: Отчет о ячейках текущей строки таблицы

source: Report current table column's cells
ru: Отчет о ячейках текущего столбца таблицы

source: Move to and report next table row
ru: Перейти к следующей строке таблицы и сообщить о ней

source: Move to and report previous table row
ru: Перейти к предыдущей строке таблицы и сообщить о ней

source: Move to and report next table column
ru: Перейти к следующему столбцу таблицы и сообщить о нем

source: Move to and report previous table column
ru: Перейти к предыдущему столбцу таблицы и сообщить о нем

source: Report current table cell position
ru: Отчет о текущей позиции ячейки таблицы

source: Move to first cell of table row
ru: Перейти в первую ячейку строки таблицы

source: Move to last cell of table row
ru: Перейти к последней ячейке строки таблицы

source: Move to first cell of table column
ru: Перейти в первую ячейку столбца таблицы

source: Move to last cell of table column
ru: Перейти к последней ячейке столбца таблицы

source: Anchor
ru: анкер

source: %s elements
ru: %s элементы

source: One element
ru: 1 элемент

source: no element
ru: нет элемента

source: Cut
ru: вырезано

source: Paste
ru: вставлено

source: Copy
ru: скопировано

source: Undo
ru: отмена

source: select all
ru: выделить все

source: one selected object
ru: выбран 1 объект

source: %s selected objects
ru: выбрано %s объектов

source: No text to add
ru: Нет текста для добавления

source: Do you want realy add the selected text to the clipboard?
ru: Вы действительно хотите добавить выделенный текст в буфер обмена?

source: Adding text to clipboard
ru: Добавление текста в буфер обмена

source: Added
ru: Добавлен

source: Cannot add
ru: Невозможно добавить

source: Any key with modifier key combination
ru: Комбинация любой клавиши с клавишей модификаторов

source: Keys's remanence activation on
ru: возможные клавиши активации

source: Keys's remanence activation off
ru: возможные клавиши отключения

source: Standard use of the numeric keypad enabled
ru: Включено стандартное использование цифровой клавиатуры

source: Standard use of the numeric keypad disabled
ru: стандартное использование цифровой клавиатуры отключено

source: Command keys selective Announcement
ru: Селективное объявление командных клавиш

source: Check &excluded keys:
ru: Установить исключения для клавиш:

source: Pressed W&ith modifier key combination:
ru: Нажат с комбинацией клавиш-модификаторов:

source: &Check all modifier combinations
ru: &Установить все измененные комбинации

source: &Uncheck all modifier combinations
ru: &Отменить все измененные комбинации клавиш

source: Do not speak command &keys
ru: Не произносите команды и клавиши

source: Do you want to save changes made in "%s" mode?
ru: Вы хотите сохранить изменения, внесенные в режим "%s"?

source: No more checked command key
ru: Больше нет проверенных командных клавиш

source: Help for complex symbols edition
ru: помощь по редактированию сложных символов

source: &Categories:
ru: &Категории

source: S&ymbols:
ru: Символы:

source: &Copy to clipboard
ru: Копировать в буфер обмена

source: &Paste
ru: &Вставить

source: &Manage your symbols
ru: &Управление символами

source: No symbol selected
ru: Нет выбранного символа

source: {0} pasted
ru: {0} вставлено

source: Symbol cannot copied to the clipboard
ru: Символ не может быть скопирован в буфер обмена

source: {0} copied
ru: {0} скопирован

source: Error: no basic symbols installed
ru: Ошибка: не установлены основные символы

source: User symbols manager
ru: Управление символами пользователя

source: &Add a symbol
ru: Добавление символа

source: &Delete the symbol
ru: Удаление символа

source: Add a &category
ru: добавление категории

source: De&lete the category
ru: удаление категории

source: &Save
ru: &Сохранить

source: %s symbol deleted
ru: символ %s удален

source: No symbol entered
ru: Символ не введен

source: Symbol is not valid
ru: неправильный символ

source: There is no description for the symbol
ru: Описание символа отсутствует.

source: The symbol is already in this category under "%s" description. Do you want to replace it?
ru: Символ уже находится в этой категории под описанием "%s". Вы хотите заменить его?

source: The symbol is allready in "{oldCat}" category. Do you want to add this symbol also in "{newCat}" category?
ru: Этот символ уже находится в категории "{oldCat}". Вы хотите добавить его также в категорию "{newCat}"?

source: %s symbol has been added
ru: %s символ добавлен

source: Enter category name:
ru: введите имя категории:

source: Adding category
ru: Добавление категории

source: "%s" category already exists
ru: "%s" категория уже имеется

source: You cannot delete this basic category.
ru: Вы не можете удалить основную категорию.

source: Do you really want to delete this category and all its symbols?
ru: Вы действительно хотите удалить эту категорию и все ее символы?

source: "%s" category has been deleted
ru: категория "%s" удалена

source: Adding Symbol in %s category
ru: Добавление символа в категорию %s

source: Enter the Symbol:
ru: Введите символ

source: Enter the Description:
ru: введите описание

source: Last used complex symbols
ru: Последние использованные сложные символы

source: &Symbols:
ru: Символы

source: &Past
ru: Вставить

source: &Delete all
ru: Удалить все

source: Do you really want to delete all symbols of the list?
ru: Вы действительно хотите удалить все символы из списка?

source: There is no symbol recorded
ru: Нет записи символа

source: Open
ru: Открыть

source: Save
ru: Сохранить

source: Save as
ru: Сохранить как

source: Find in
ru: Найти в

source: Selected folder name not found
ru: Выбранное папка не найдено

source: Folder %s
ru: папка %s

source: Temporary Audio device manager
ru: Временный диспетчер аудиоустройств

source: Current temporary audio device: %s
ru: Текущий временный диспетчер аудиоустройств: %s

source: None
ru: Нет

source: Select a &device:
ru: Выберите устройство:

source: &Set as temporary audio device
ru: Установить как временное аудиоустройство

source: &leave up the temporary audio device
ru: отключить временное аудиоустройство

source: Confirm
ru: Подтверждение

source: You have %s seconds to accept the use of this audio device for all configuration profiles regardless of the choice made in their voice settings
ru: У вас есть %s секунд разрешить использование этого аудиоустройства для всех профилей конфигурации независимо от выбора, сделанного в их голосовых настройках

source: &Accept
ru: принять

source: Computer shutdown
ru: выключение компьютера

source: &Hibernate
ru: Спящий режим

source: &Shutdown
ru: &Выключить

source: &Reboot
ru: &Перезагрузка

source: F&orce running programs to close without warning
ru: Быстро работающие программы закрываются без предупреждения

source: &Delay before shutdown or reboot between {min} and {max} seconds
ru: Задержка перед выключением или перезагрузкой между {min} и {max} секунд

source: Computer Shutdown
ru: Выключение компьютера

source: Computer reboot
ru: Перезагрузка компьютера

source: Computer hibernation
ru: Переход в ждущий режим

source: Number of seconds to wait before shutdown:
ru: Количество секунд ожидания перед выключением:

source: Number of seconds to wait before reboot:
ru: Количество секунд ожидания перед перезагрузкой:

source: Number of seconds to wait before hibernation:
ru: Количество секунд ожидания перед переходом в ждущий режим:

source: &Report remaining time
ru: Сообщить оставшееся время

source: Remaining time: %s seconds
ru: Оставшееся время: %s секунд

source: Shut down ...
ru: Выключение...

source: Computer's rebooting ...
ru: Компьютер перезагружается

source: Hibernate isn't available. So, sleep mode is activated.
ru: Гибернация недоступна. Активирован спящий режим.

source: Volume
ru: громкость

source: Volume on
ru: громкость включена

source: volume off
ru: громкость выключена

source: No audio controller for this application
ru: Нет аудиоконтроллера для этого приложения

source: percent
ru: процент

source: Unavailable for NVDA
ru: Недоступно для NVDA

source: Impossible, the volume level cannot be lower than the configured recovery threshold equal to %s
ru: Невозможно, уровень громкости не может быть ниже настроенного порога восстановления, равного %s

source: Volume control
ru: Управление громкостью

source: Set the volume of current focused application to %s percent
ru: установка громкости текущего приложения %s процент

source: Set the main volume to %s
ru: установка основной громкости %s

source: Not available on this operating's system
ru: Недоступно в этой операционной системе

source: The main volume and that of NVDA are established and their level sets to the one in the configuration
ru: Устанавливаются основная громкость и громкость NVDA, и их уровень устанавливается на тот, который задан в конфигурации.

source: Keyboard Keys's renaming
ru: Переименование клавиш

source: NVDA defined key labels:
ru: Установка меток для клавиш NVDA

source: Modified label:
ru: Измененная метка:

source: &Modify
ru: &Изменить

source: &Remove
ru: &Удалить

source: R&emove all
ru: &Удалить все
