Repository: blindelectron/configs
Catalog: nvda/addons/NVDAExtensionGlobalPlugin/locale/*/LC_MESSAGES/nvda.po
Languages: ru

source: Report &discrepancies
ru: Расхождения в отчетах

source: Anomalies
ru: Аномалии

source: Report a&nomalies
ru: Сообщить об аномалиях

source: &Verify:
ru: Проверять:

source: &For symbols:
ru: Для символов:

source: Formatting
ru: Форматирование

source: Report &changes
ru: Сообщить об изменениях

source: Ty&pe:
ru: Тип:

source: Alert
ru: Уведомление

source: Report &by:
ru: Отчет по

source: Sounds:
ru: Звуки:

source: Frequency:
ru: Частота:

source: Length:
ru: Длина:

source: Message:
ru: Сообщение:

source: Profile settings's %s
ru: настройки профиля %s

source: Beep
ru: Звуковой сигнал

source: Sound
ru: Звук

source: Alert message
ru: Предупреждающее сообщение

source: Detections's number
ru: Количество обнаружений

source: detailed description
ru: Подробное описание

source: The multiple contiguous spaces
ru: Множественные смежные пространства

source: The space or Tab at end
ru: Пробел или табуляция в конце

source: The isolated or non spaced punctuations
ru: Изолированные или неразмещенные знаки препинания

source: The uppercase missing or inversed
ru: Прописные буквы пропущены или инвертированы

source: The required space before the symbol
ru: Требуется пробел перед символом

source: The required space after the symbol
ru: Требуется пробел после символа

source: unexpected space before symbol
ru: неожиданный пробел перед символом

source: unexpected space after symbol
ru: неожиданный пробел после символа

source: Font's name
ru: Название шрифта

source: Font's size
ru: Размер шрифта

source: Font's attributes
ru: Атрибуты шрифта

source: Style
ru: Стиль

source: Color
ru: Цвет

source: Text analyzer activated
ru: Текстовый анализатор активирован

source: Text analyzer desactivated
ru: Текстовый анализатор деактивирован

source: Error: the "%s" folder cannot be deleted
ru: Ошибка: папка "%s" не может быть удалена

source: User Configurations's management
ru: Управление конфигурацией пользователя

source: Configuration's &folders:
ru: Папка конфигурации

source: &Restart NVDA with this configuration's folder
ru: перезапуск NVDA с конфигурацией из этой папки

source: &Prepare this folder
ru: Подготовьте эту папку

source: &Delete this folder
ru: Удалить эту папку

source: Empt&y this folder
ru: Очистить эту папку

source: E&xplore this folder
ru: открыть эту папку

source: Add &new folder
ru: Добавить новую папку

source: Add &existing folder
ru: Добавить существующую папку

source: &Modify this folder
ru: Изменить эту папку

source: Active configuration
ru: Активная конфигурация

source: Do you really want to restart NVDA with this user configuration's folder: %s?
ru: Вы действительно хотите перезапустить NVDA с этой пользовательской папкой конфигурации: %s

source: You are going to modify the active configuration's folder. Do you want to continue?
ru: Вы собираетесь изменить папку активной конфигурации. Вы хотите продолжить?

source: Impossible to create %s folder
ru: Невозможно создать папку %s

source: Active configuration path cannot be deleted
ru: Путь активной конфигурации не может быть удален

source: Do you really want to delete the "%s" folder?
ru: Вы действительно хотите удалить папку "%s"?

source: The folder %s is already empty
ru: папка %s уже пустая

source: Do you really want to delete all the content of the "%s" folder?
ru: Вы действительно хотите удалить все содержимое папки "%s"?

source: End of deletion
ru: Удаление завершено

source: Preparation of %s folder
ru: Подготовка папки %s

source: Import from &folder:
ru: Импортировать из папки

source: Import &add-ons
ru: Импортировать дополнения

source: Import speech &dictionaries
ru: Импортировать словари произношения

source: Import ponctuation/symbol &pronunciations
ru: Импортировать пунктуацию / произношение символов

source: Import input &gesture changes
ru: Импортировать измененные жесты

source: Import configuration p&rofiles
ru: Импортировать профили конфигурации

source: Import &NVDA parameters (normal configuration)
ru: Импортировать настройки nvda

source: Import all the &configuration
ru: Импортировать всю конфигурацию

source: Import terminated
ru: Импорт завершен

source: No addon to import
ru: Нет дополнения для импорта

source: %s add-on exists. Do you want to replace it?
ru: %s дополнение существует. Вы хотите его заменить?

source: No profile to import
ru: Нет профиля для импорта

source: No speech dictionary to import
ru: Нет словаря произношения для импорта

source: The configuration folder contains already speech dictionaries. Do you want to replace them?
ru: В папке конфигурации уже есть словари речи. Хотите заменить их?

source: No ponctuation or symbol pronunciations to import
ru: Нет пунктуации или произношения символов для импорта

source: The configuration folder already contains symbol/punctuation pronunciations. Do you want to replace it?
ru: Папка конфигурации уже содержит символы / пунктуацию. Вы хотите заменить их?

source: No input gesture change to import
ru: Нет измененных жестов для импорта

source: The configuration folder already contains input gesture changes. Do you want to replace them?
ru: Папка конфигурации уже содержит изменения жестов. Вы хотите их заменить?

source: No NVDA normal configuration to import
ru: нет конфигурации nvda для импорта

source: The configuration folder already contains NVDA normal configuration. Do you want to replace it?
ru: Папка конфигурации уже содержит конфигурацию NVDA. Вы хотите заменить ее?

source: The "%s" folder contains data that will be erased during copying. Do you still wish to continue?
ru: папка "%s" содержит данные которые будут удалены при копировании. Вы все еще хотите продолжить?

source: Modification of %s folder
ru: Модификация папки %s

source: Addons's import
ru: Импорт дополнений

source: &Add-ons:
ru: Дополнения:

source: Check &all
ru: отметить все

source: &Uncheck all
ru: отменить все

source: &Delete existing add-ons
ru: Удалить имеющиеся дополнения

source: &Import
ru: &Импорт

source: all items are checked
ru: все элементы отмечены

source: all items are unchecked
ru: Все элементы не отмечены

source: Do you really want to delete all add-ons of %s folder?
ru: вы действительно хотите удалить все дополнения из папки %s?

source: confirmation
ru: подтверждение

source: there is no add-on checked
ru: дополнения не отмечены

source: Adding new folder
ru: Добавление новой папки

source: folder's userName:
ru: имя папки:

source: folder's &location:
ru: Путь папки

source: &Browse...
ru: обзор

source: &Add
ru: добавить

source: Folder's selection
ru: выбрана папка

source: you must specify the username of the folder
ru: необходимо указать имя папки

source: You must specify the path to the location of the configuration
ru: необходимо указать путь к конфигурации

source: The folder with "%s" username is already in the list of configuration folders
ru: папка с именем "%s" уже находится в списке папок конфигурации

source: choose another username
ru: выберите другое имя

source: The "%s" folder already exists and it's a nvda configuration folder. Do you want to add it anyway?
ru: папка "%s" уже существует, и это папка конфигурации nvda. Вы все равно хотите его добавить?

source: The "%s" folder already exists and it's not a nvda configuration folder. Do you want to add it anyway?
ru: Папка "%s" уже существует, и это не папка конфигурации nvda. Вы все равно хотите его добавить?

source: Adding existing folder
ru: Добавление существующей папки

source: folder's &path:
ru: Путь папки:

source: The folder is not user configuration's folder
ru: Папка не является папкой конфигурации пользователя.

source: Configuration profiles's import
ru: Импорт профилей конфигурации

source: &Profiles:
ru: Профили:

source: &Delete existing profiles
ru: Удаление существующих профилей

source: Do you really want to delete all profiles of %s folder?
ru: Вы действительно хотите удалить все профили из папки %s?

source: There is no profile checked
ru: Профиль не проверен

source: %s profile exists. Do you want to replace it?
ru: профиль %s существует. Вы хотите заменить его?

source: Impossible to import profils
ru: Невозможно импортировать профили

source: Records:
ru: Записи

source: The current configuration of the "Voice profile switching"feature is not compatible with this add-on's version, All selectors have been released and the voice profiles deleted. Sorry for the inconvenience.
ru: Текущая конфигурация функции " Переключение голосового профиля " не работаетне совместим с версией этого дополнения, все селекторы были выпущены иголосовые профили удалены. Приносим извинения за неудобства

source: warning
ru: Предупреждение

source: Impossible, the synthesizer of voice profile {voiceProfileName} associated to selector {selector} is not available. Do you want to free this selector?
ru: Невозможно, синтезатор голосового профиля {voiceProfileName} связанный к селектору {selector} недоступно. Вы хотите освободить этот селектор?

source: Synthesizer error
ru: ошибка синтезатора

source: Selector {selector}: {name}
ru: Селектор {selector}: {name}

source: no other selector set to voice profile
ru: другой селектор не настроен на голосовой профиль

source: no selector set to voice profile
ru: ни один селектор не настроен на голосовой профиль

source: yes
ru: да

source: no
ru: нет

source: {name} voice profile set to selector {selector}
ru: {name} голосовой профиль установлен на селектор {selector}

source: all selectors are freed from their vocal profile
ru: все селекторы освобождаются от своего голосового профиля

source: Automatic language switching (when supported)
ru: Автоматическое переключение языка (если поддерживается)

source: Automatic dialect switching (when supported)
ru: Автоматическое переключение диалектов (если поддерживается)

source: Punctuation/symbol level
ru: уровень пунктуации

source: Trust voice's language when processing characters and symbols
ru: Доверяйте языку голоса при обработке знаков и символов

source: Include Unicode Consortium data (including emoji) when processing characters and symbols
ru: Включать данные Консорциума Unicode (включая эмодзи) при обработке знаков и символов

source: Capital pitch change percentage
ru: Процент изменения тона для заглавных букв

source: Say cap before capitals
ru: Говорить заглавная буква

source: Beep for capitals
ru: Звуковой сигнал для заглавных букв

source: Use spelling functionality if supported
ru: Используйте функцию проверки орфографии, если она поддерживается

source: selector: %s
ru: селектор: %s

source: Voice profile name: %s
ru: имя голосового профиля: %s

source: Associated under %s configuration profile
ru: связанный %s профиль конфигурации

source: Synthesizer: %s
ru: синтезатор: %s

source: Output device: %s
ru: выходное устройство: %s

source: Voice profile selectors's Management of profile %s
ru: управление селекторами голосовых профилей %s

source: &Selectors
ru: &Селекторы

source: free
ru: свободный

source: &Use selectors associated under normal cconfiguration's profile
ru: Используйте селекторы, связанные с профилем нормальной конфигурации

source: &Activate voice profile
ru: активация голосового профиля

source: A&ssociate voice profile
ru: Связанный голосовой профиль

source: &Modify voice profile
ru: Изменить голосовой профиль

source: &Free selector
ru: свободные селекторы

source: &Free all selectors
ru: все свободные селекторы

source: Voice profile's &informations
ru: информация о голосовом &профиле

source: Voice profile 's informations
ru: информация о голосовом профиле

source: Selector {selector} is already set to {voiceProfileName} voice profile. Do you want to replace this voice profile?
ru: селектор {selector} уже установлен в голосовом профиле {voiceProfileName}. Вы Хотите заменить этот голосовой профиль?

source: Do you really want to free selector {selector} associated to the voice profile "{voiceProfileName}"?
ru: Вы действительно хотите, чтобы селектор {selector} был связан с голосомпрофиль "{voiceProfileName}"?

source: Do you really want to free all selectors set to this configuration profile?
ru: Вы действительно хотите освободить все селекторы, установленные для этого профиля конфигурации?

source: Modify voice profile
ru: изменение голосового профиля

source: voice profile name:
ru: Имя голосового профиля:

source: &Default
ru: По умолчанию

source: You must set the name of voice profile
ru: Вы должны установить имя голосового профиля

source: Voice profile association
ru: Ассоциация голосового профиля

source: System tray icons 's list
ru: Список значков на панели задач

source: &Icons
ru: &Значки

source: &Right click
ru: &Правый клик

source: &Left click
ru: &Левый клик

source: Dou&ble left click
ru: &Двойной левый клик

source: color
ru: цвет

source: background color
ru: цвет фона

source: bold
ru: жирный

source: non bold
ru: не жирный

source: italic
ru: курсив

source: non italic
ru: не курсив

source: underline
ru: подчеркивать

source: non underline
ru: не подчеркивать

source: strikethrough
ru: зачеркивание

source: non strikethrough
ru: не зачеркнутый

source: hidden
ru: скрытый

source: non hidden
ru: не скрытый

source: subscript
ru: нижний индекс

source: superscript
ru: надстрочный индекс

source: base line
ru: базовая линия

source: unexpected space
ru: неожиданное пространство

source: missing space
ru: недостающее пространство

source: missing uppercase
ru: пропущенные прописные буквы

source: inversed uppercase
ru: инвертированный верхний регистр

source: unexpected %s
ru: непредвиденный %s

source: multiple contigous spaces
ru: несколько смежных пробелов

source: tab at end
ru: таб в конце

source: space at end
ru: пробел в конце

source: change in %s
ru: изменение в %s

source: At {pos}: {anomaly}
ru: {pos}: {anomaly}

source: %s analyzis's detections
ru: %s обнаружения анализируемых

source: Error: buildVars.py file is not found
ru: ошибка: файл buildVars.py не найден

source: error
ru: ошибка

source: Cannot get add-on translated manifest of %s language
ru: невозможно перевести manifest дополнения на %s язык

source: Creation of HTML documentation files
ru: Создание html файлов документации

source: No documentation file to convert
ru: Нет файла документации для преобразования

source: No file converted
ru: Файл не преобразован

source: %s files converted
ru: %s файлов преобразовано

source: Creation of manifest.ini file
ru: создание файла manifest.ini

source: The manifest.ini file already exists. Do you really want to update it?
ru: файл manifest.ini уже существует, вы хотите обновить его?

source: manifest.ini file has been updated
ru: файл manifest.ini обновлен

source: Creation of localization manifest.ini file
ru: создание локализованного файла manifest.ini

source: No language for this add-on
ru: нет языка для дополнения

source: Error: %s file is not found
ru: ошибка: файл %s не найден

source: Some translation strings are missing for "%s" language
ru: Некоторые строки перевода отсутствуют для "%s" языка

source: %s localization manifest.ini files created
ru: %s локализованный файл manifest.ini создан

source: No localization manifest.ini file created
ru: локализованный файл manifest.ini не создан

source: Creation of POT file of %s add-on
ru: создание POT файла %s дополнения

source: %s file created
ru: файл %s создан

source: Impossible to create POT file: no source file defined in buildVars.py
ru: невозможно создать POT файл: исходный файл не определен в buildVars.py

source: Impossible to create POT file
ru: Невозможно создать POT файл

source: Prepare %s add-on
ru: подготовить дополнение %s

source: Prepare add-on start
ru: подготовка дополнения к запуску

source: Manifest.ini file updated
ru: файл Manifest.ini обновлен

source: %s localization manifest.ini files created or updated
ru: файлы %s локализации manifest.ini созданы или обновлены

source: But for these languages, some strings are not translated: %s
ru: Но для этих языков некоторые строки не переведены: %s

source: one file converted
ru: один файл преобразован

source: %s HTML files created
ru: %s HTML файлы созданы

source: {count} poFiles compiled on {nb}
ru: {count} po Файлы скомпилированы на {nb}

source: Add-on bundle could not be created
ru: пакет дополнения не может быть создан

source: The {name} file has been created and recorded in {dir} folder
ru: файл {name} был создан и записан в {dir} папке

source: Completed
ru: завершено

source: Creation of buildVars.py file
ru: создание файла buildVars.py

source: Warning: buildVars.py already exists. Do you want to replace it?
ru: Предупреждение: файл buildVars.py уже существует. Вы хотите его перезаписать?

source: buildVars.py file created
ru: файл buildVars.py создан

source: Tools for add-on development
ru: инструменты для разработки дополнений

source: Update add-on &version
ru: обновление версии дополнения

source: &Update manifest.ini file
ru: обновление файла manifest.ini

source: Create P&OT file
ru: Создать POT файл

source: &Prepare addon
ru: подготовить дополнение

source: &Languages:
ru: &языки

source: Create &localization manifest.ini file
ru: создание локализованного файла manifest.ini

source: Create &HTML documentation files
ru: создание html файлов документации

source: Create &buildVars file
ru: создание buildVars файла

source: &Explore add-on folder
ru: &Открыть папку дополнения

source: All
ru: Все

source: Update add-on version
ru: обновление версии дополнения

source: Error: buildVars.py file has no add-on version line
ru: ошибка: файл buildVars.py не имеет версии дополнения

source: Version of buildVars.py file has been updated
ru: обновлена версия в файле buildVars.py

source: Entry add-on version:
ru: введите версию дополнения:

source: No add-on installed
ru: дополнение не установлено

source: The update is not compatible with this version of NVDA. Minimum NVDA version: {minYear}.{minMajor}, last tested: {testedYear}.{testedMajor}.
ru: Обновление несовместимо с этой версией NVDA. Минимальный NVDAверсия: {minYear}.{minMajor}, последнее тестирование: {testedYear}.{testedMajor}.

source: Downloading {name}
ru: загрузка {name}

source: Error downloading update for {name}.
ru: ошибка загрузки обновления для {name}.

source: Cannot update {name} - missing file or invalid file format
ru: не может быть обновлен {name} - отсутствует файл или неверный формат файла

source: Updating
ru: обновление

source: Please wait while the add-on is being updated.
ru: пожалуйста подождите, пока дополнение обновляется

source: Failed to update {name} add-on
ru: не удалось обновить {name} дополнения

source: {summary} - update
ru: {summary} - обновление

source: The service is temporarily under maintenance. Please, try again later.
ru: Сервис временно недоступен. Пожалуйста, повторите попытку позже.

source: New version%s is available. Do you want to download it now?
ru: доступна новая версия %s. Хотите ее загрузить?

source: You are up-to-date. %s is the latest version.
ru: последняя версия %s

source: Oops! There was a problem checking for updates. Please retry later
ru: Ой! При проверке обновлений возникла проблема. Повторите попытку позже

source: &Yes
ru: &Да

source: &No
ru: &Нет

source: &Later
ru: &Позже

source: Wha&t's new
ru: Что нового

source: User input Gestures
ru: пользовательские жесты

source: Remove &all
ru: Удалить все

source: Do you really want to erase all the modifications of input gesture that have been made?
ru: вы действительно хотите удалить все сделанные жесты?

source: Deleted gestures
ru: Удаление жестов

source: "%s" dialog is already open
ru: "%s" диалог уже открыт

source: No help available here.
ru: Здесь нет раздела помощи.

source: No user guide found.
ru: Руководство пользователя не найдено.

source: Informations
ru: Информация

source: Co&py to Clipboard
ru: копировать в буфер обмена

source: Copied
ru: Копирование

source: Error, the information cannot be copied to the clipboard
ru: Ошибка, информацию нельзя скопировать в буфер обмена

source: interrupted
ru: прервано

source: Elements's searching
ru: Поиск элементов

source: List, list's item
ru: список, элемент списка

source: Tab
ru: Таб

source: table item
ru: элемент таблица

source: menu item
ru: элемент меню

source: list of visible items making up the object in the foreground
ru: список видимых элементов, составляющих объект на переднем плане

source: Ignore untagged items
ru: Игнорировать немаркированные элементы

source: &Type:
ru: &Тип:

source: Elements:
ru: Элементы:

source: Move &navigator object to it
ru: Переместить на него объект навигатора
