Repository: blindelectron/configs
Catalog: nvda/addons/typing_settings/locale/*/lc_messages/nvda.po
Languages: ar

source: typing settings
ar: إعدادات الكتابة

source: typing sound:
ar: صوت الكتابة:

source: sounds
ar: الأصوات

source: speek characters
ar: نطق الأحرف

source: anywhere
ar: في أي مكان

source: in edit boxes only
ar: في حقول التحرير فقط

source: off
ar: إيقاف

source: speak words
ar: نطق الكلمات

source: play sounds while typing
ar: تشغيل الأصوات عند الكتابة

source: speak passwords
ar: نطق كلمات المرور

source: Enable and disable typing sounds
ar: تمكين وتعطيل أصوات الكتابة

source: typing sounds off
ar: أصوات الكتابة إيقاف

source: typing sounds on
ar: أصوات الكتابة تفعيل

source: Enable or disable speak passwords
ar: تمكين أو تعطيل نطق كلمات المرور

source: speak passwords off
ar: نطق كلمات المرور تعطيل

source: speak passwords on
ar: نطق كلمات المرور تفعيل

source: Switches between the available speak characters modes.
ar: يبدل بين أوضاع نطق الأحرف المتاحة.

source: speak typed characters off
ar: نطق الأحرف المكتوبة تعطيل

source: speak typed characters anywhere
ar: نطق الأحرف في أي مكان

source: speak typed characters in edit boxes only
ar: نطق الأحرف في حقول التحرير فقط

source: Switches between the available speak words modes.
ar: يبدل بين أوضاع نطق الكلمات المتاحة.

source: speak typed words off
ar: نطق الكلمات تعطيل

source: speak typed words anywhere
ar: نطق الكلمات في أي مكان

source: speak typed words in edit boxes only
ar: نطق الكلمات في حقول التحرير فقط
